In [1]:
# Series indexing (obj[...]) works analogously to NumPy array indexing

import pandas as pd
import numpy as np

In [2]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [3]:
obj['b'] # access by label

1.0

In [4]:
obj[1] # by index

1.0

In [6]:
obj[1:4] # slicing in pandas a  bit diff than normal python where end-point is inclusive

b    1.0
c    2.0
d    3.0
dtype: float64

In [7]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [8]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [9]:
# filtering
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [12]:
# setting using these methods modifies the corresponding sectuon of the series
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [15]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), 
        index=['Ohio', 'Colorado', 'Utah', 'New York'], 
        columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [16]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [17]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [18]:
# slicing
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [19]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [21]:
# scalar comparison:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [23]:
#assignment
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [25]:
# SELECTION WITH loc AND iloc
# they enable us to select a subset of the rows and columns from a DataFrame with NumPy-like notation using either axis labels (loc) or integers (iloc)

In [26]:
# using loc for labels
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [27]:
# using iloc for integers
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [28]:
# iloc
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [33]:
data.iloc[[1, 2], [0, 1, 2, 3]]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11

In [ ]:
# both indexing functions work with slices in addition to single labels or lists of labels:
data.loc[:'Utah', 'two']